SUBOFFcyj/01_3d_laminar_NK128/system/controlDict
 /*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  v2312
      \\/     M anipulation  |
 \*---------------------------------------------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       dictionary;
     object      controlDict;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 application     simpleFoam;
 startFrom       startTime;
 startTime       0;
 stopAt          endTime;
 endTime         2000;
 deltaT          1;
 writeControl    timeStep;
 writeInterval   200;
 purgeWrite      0;
 writeFormat     ascii;
 writePrecision  14;
 writeCompression off;
 timeFormat      general;
 timePrecision   6;
 runTimeModifiable true;