SUBOFFcyj/01_3d_laminar_NK128/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

Uref (1.649194 0 0);

boundaryField
{
    INLET1
    {
        type            fixedValue;
        value           uniform $Uref;
    }

    INLET2
    {
        type            fixedValue;
        value           uniform $Uref;
    }

    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform $Uref;
    }

    HULL
    {
        type            noSlip;
    }
}


// ************************************************************************* //
