SUBOFFcyj/01_3d_laminar_NK128/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05; // Slightly loosened for inner loop speed
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1; // 0.1 is standard and saves computation time
    }
}

SIMPLE
{
    // Crucial for accuracy on the curved bow mesh
    nNonOrthogonalCorrectors 2; 
    consistent      yes;
    
    // Optional but highly recommended: stops the solver when it converges
    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|omega)"     1e-5;
    }
}

relaxationFactors
{
    equations
    {
        // 0.9 is safer for SIMPLEC startup
        U               0.9; 
        
        // Turbulence is volatile; relaxing it heavily prevents early crashes
        "(k|epsilon|omega|f|v2)" 0.7; 
    }
}

// ************************************************************************* //
